Repository: bytePassion/OpenQuoridorFramework
Catalog: OpenQuoridorFramework/OQF.Resources/LanguageDictionaries/Captions.*.resx
Languages: de

# PvB_BrowseForBotButtonToolTipCaption
source: Browse for Bot-DLL
de: Durchsuchen nach Bot-DLL

# PvB_StartGameButtonToolTipCaption
source: Start Game
de: Spiel Starten

# PvB_OpenInfoButtonToolTipCaption
source: Help and About
de: Hilfe / Über

# PvB_MaximalThinkingTimeLabelCaption
source: Thinking-Time left
de: restliche Bot-Berechnungszeit

# PvB_WallsLeftLabelCaption
source: Walls
de: Wände

# PvB_ProgressCaption
source: Game Progress
de: Spielfortschritt

# PvB_AutoScrollDownCheckBoxCaption
source: Auto scroll down
de: Automatisch scrollen

# PvB_CapitulateButtonCaption
source: Capitulate
de: Kapitulieren

# PvB_HeaderCaptionPlayer
source: Player
de: Spieler

# WD_YesButtonCaption
source: Yes
de: Ja

# WD_NoButtonCaption
source: No
de: Nein

# WD_WinningMessage
source: Congratulations! You beated the bot!
de: Glückwunsch! Du hast den Bot besiegt!

# WD_Message_Reason
source: Reason
de: Grund

# WinningReason_RegularQuoridorWin
source: Regular win (first on the other side)
de: Regulärer Sieg (erster auf der anderen Seite)

# WinningReason_Capitulation
source: Capitulation
de: Kapitulation

# WinningReason_InvalidMode
source: Invalid move
de: Ungültiger Zug

# WinningReason_ExceedanceOfMaxMoves
source: The maximum of allowed moves was exceeded
de: The maximum of allowed moved where exceeded

# WinningReason_ExceedanceOfThoughtTime
source: The maximum thought time was exceeded
de: Die maximale Bedenkzeit wurde überschritten

# WD_LoosingMessage
source: Sry ... you got beaten by the bot
de: Schade, du hast gegen den Bot verloren

# WD_SaveGameRequest
source: Do you want to save the Game?
de: Willst du das Spiel speichern?

# QRP_PageHeader
source: Quoridor - Rules
de: Quoridor - Spielregeln

# QRP_GeneralParagraphText
source: Quoridor is an abstract strategy game for 2 or 4 Player. The OpenQuoridorFramework only considers the 2-player-game. Therefor only those rules are presented here.
de: Quoridor ist ein abstraktes Strategiespiel für 2 oder 4 Spieler. Im OpenQuoridorFramework wird nur das 2-Spieler-Spiel betrachtet, weswegen hier auch nur die Regeln für diese Variante aufgeführt werden.

# QRP_GeneralParagraphHeader
source: General
de: Allgemein

# QRP_GameSetupParagraphHeader
source: Game Setup
de: Spielaufbau

# QRP_GameSetupParagraphText
source: Quoridor is played on a board with 9 by 9 fields with spaces between these fields (picture 1). On the Board are two pawns, which are moved from field to field and there are 20 Walls that can be placed between the fields. On startup the pawns are placed on the fields e1 and e9 (see Quoridor-Notation). The player who controls the pawn on field e1 starts first.
de: Quoridor besteht aus einem Spielfeld mit 9x9 Feldern mit Zwischenräumen (Bild 1), zwei Spielfiguren, die auf den Feldern bewegt werden und 20 Wand-Elementen, die in den Zwischenräumen der Felder platziert werden können. Jeder Spieler erhält eine Spielfigur und 10 Wand-Elemente. Die Spielfiguren werden auf den Feldern e1 und e9 (siehe Quoridor-Notation) initial platziert. Der Spieler mit der Figur auf e1 beginnt mit dem ersten Zug.

# QRP_GameGoalParagraphHeader
source: Game Goal
de: Spielziel

# QRP_GameGoalParagraphText
source: The game ends immediately when one pawn reaches on field of the most opposite row. This player wins.
de: Das Spiel endet sofort, wenn ein Spieler eines der 9 gegenüberliegenden Felder betritt. Dieser Spieler gewinnt.

# QRP_GameFlowParagraphHeader
source: Game Flow
de: Spielablauf

# QRP_GameFlowParagraphText
source: Both players move alternating until a winner is determined. When it is one player's turn, he have to choose between two different kinds of moves. Ether he has to move his pawn by one space or he has to place a wall on the board. If a player has no walls left, he has to move. The figure can only be moved by one space horizontal oder vertical, but not diagonal, not over a wall and not off the board. If the decides to place a wall, it is important to place this wall only between four fields, but not overlapping with another wall and not half off the board. It is also important that the opponend player always has a possible path to one of his goal-fields.
de: Es wird abwechseld gezogen bis ein Gewinner ermittelt ist. Ist ein Spieler an der Reihe muss er eine von 2 Aktionen ausführen. Entweder muss die Figur bewegt, oder ein Wand-Element platziert werden. Hat der Spieler kein Wand-Element mehr übrig, muss er die Figur ziehen. Eine Figur kann immer nur 1 Feld weit in eine Richtung (horizontal oder vertikal) bewegt werden. Jedoch nicht diagonal, nicht über ein Wand-Element und auch nicht aus dem Spielfeld heraus. Beim Setzen der Wand-Elemente ist zu beachten, dass sich diese immer zwischen den Feldern befinden müssen, sich nicht überschneiden dürfen, nicht aus dem Brett herausragen dürfen und dem Gegner immer ein Weg zu einem Zielfeld offen gehalten werden muss.

# QRP_SpecialMoveParagraphHeader
source: Special moving rules
de: Sonderregeln zur Bewegung

# QRP_SpecialMoveParagraphText
source: If two pawns are in adjecent fields, so that one could step on the other (picture 2), this pawn can jump over the other pawn (picture 3). If the jumping pawn cannot reach the field behind the other pawn (because there is a wall or the end of the board), he can jump diagonal to the left or right of the pawn. Of course in this scenario the fields to jump on have to be reachable. The pictures 4 and 5 show two of these situations with the possible moves.
de: Stehen die Figuren der Spieler in benachbarten Feldern, sodass der, der am Zug ist, auf das Feld des Anderen ziehen könnte (Bild 2), kann dieser den Gegner überspringen (Bild 3). Ist jedoch das Feld hinter der Figur nicht begehbar (weil es nicht existiert oder eine Wand im Weg ist), sind die Felder links und rechts des zu überspringenden Gegners potenzielle Zielfelder. Aber auch diese sind nur erreichbar, wenn keine Wand-Elemente den Weg versperren. Die Bilder 4 und 5 zeigen entsprechende Szenarien mit den jeweils möglichen Sprungpositionen.

# QRP_Picture1Caption
source: Picture 1
de: Bild 1

# QRP_Picture2Caption
source: Picture 2
de: Bild 2

# QRP_Picture3Caption
source: Picture 3
de: Bild 3

# QRP_Picture4Caption
source: Picture 4
de: Bild 4

# QRP_Picture5Caption
source: Picture 5
de: Bild 5

# AP_PageHeader
source: About OpenQuoridorFramework
de: Über OpenQuoridorFramework

# AP_ApplicationSectionHeader
source: Application
de: Anwendung

# AP_DeveloperSectionHeader
source: Developers
de: Entwickler

# AP_ThirdPartySectionHeader
source: 3rd Party Usages
de: Fremd-Anbieter-Elemente

# AP_QuoridorInventorSubItem
source: Inventor
de: Erfinder

# AP_QuoridorPublisherSubItem
source: Publisher
de: Verlag

# AP_LicenceSectionHeader
source: Licence
de: Lizenz

# QNP_GeneralParagraphHeader
source: General
de: Allgemein

# QNP_GeneralParagraphText
source: Because there is no offical Quoridor-notation, one for was created for the OpenQuoridorFramework. It is derived from several notations used across the quoridor-community.
de: Da es keine offizielle Notation für Quoridor gibt, wurde für das OpenQuoridorFramework eine Notation entwickelt, die sich aus einigen zusammensetzt, die sich in wissenschaftlichen Arbeiten und den Internet-Communities finden lassen.

# QNP_Picture1Caption
source: Picture 1
de: Bild 1

# QNP_Picture2Caption
source: Picture 2
de: Bild 2

# QNP_TheBoardParagraphHeader
source: The Board
de: Das Spielfeld

# QNP_FigureMoveParagraphHeader
source: Move (Figure)
de: Spielzug (Figur)

# QNP_WallMoveParagraphHeader
source: Move (Wall)
de: Spielzug (Wand)

# QNP_ExampleParagraphHeader
source: Example
de: Beispiel

# QNP_TheBoardParagraphText
source: To address a field uniquely all rows are coded by the numbers 1 to 9 and all columns are coded by the letters 'a' to 'i' (picture 1). This results in a game-space of 81 fields from a1 in the lower left corner to i9 in the upper right corner.
de: Angelehnt an die Schach-übliche Notation werden die Spalten durch Buchstaben und die Reihen durch Zahlen eindeutig zugeordnet. Wie in Bild 1 zu sehen ist, ergibt sich so ein Spielraum vom Feld a1 (links unten) bis zum Feld i9 (rechts oben).

# QNP_FigureMoveParagraphText
source: A move, where the pawn is relocated is noted by the field he is stepping on. If, for example, a player moves from c3 to c4, this move is written down as 'c4'.
de: Ein Spielzug, bei dem die Figur bewegt wird, wird lediglich durch das Feld notiert, auf das der Spieler zieht. Bewegt ein Spieler beispielsweise seine Figur von c3 nach c4 wird dieser Zug als 'c4' notiert.

# QNP_WallMoveParagraphText
source: When a wall is placed on the board this move gets notates by the unique position of this wall. A wall have to be placed between four field. Therefore it is sufficent to store one of these four fields. This notation uses the upper left field for this purpose. Additional the orientation has to be noted. If the wall is placed vertically this is denoted by an 'v'. Or an 'h' for horizontal placed walls.
de: Ein Spielzug, bei dem ein Wand-Element platziert wird, wird durch eine eindeutige Positionsangabe des neuen Wand-Elements festgehalten. Eine Wand muss sich immer zwischen vier Feldern befinden. Folglich reicht es aus, eines dieser vier Felder und die Ausrichtung der Wand zu notieren. Bei der hier festgelegten Notation wird dazu das Feld links oben verwendet. Die Ausrichtungen werden durch ein 'h' für 'horizontal' und ein 'v' für 'vertikal' abgekürzt.

# QNP_ExampleParagraphText
source: In this notation the pawn on picture 2 are on 'c3' and 'e8'. The positions of the walls would be denoted as 'd4h' and 'f8v'.
de: Nach der oben beschriebenen Notation befinden sich die Figuren in Bild 2 auf den Positionen 'c3' und 'e8'. Die beiden Wand-Elemente werden als 'd4h' und 'f8v' notiert.

# IP_QuoridorRulesButtonCaption
source: Quoridor Rules
de: Quoridor Spielregeln

# IP_HowToWriteABotButtonCaption
source: How to write a bot
de: Wie man einen Bot entwickelt

# IP_AboutButtonCaption
source: About
de: Über

# IP_ReplayViewerInfoButtonCaption
source: Application Help
de: Hilfe zur Anwendung

# IP_PlayerVsBotInfoButtonCaption
source: Application Help
de: Hilfe zur Anwendung

# IP_BotVsBotIntoButtonCaption
source: Application Help
de: Hilfe zur Anwendung

# IP_TournamentInfoButtonCaption
source: Application Help
de: Hilfe zur Anwendung

# IP_CloseButtonCaption
source: Close
de: Schließen

# HTWAB_PageHeader
source: How to write a bot
de: Wie man einen Bot entwickelt

# HTWAB_GeneralProceedingParagraphHeader
source: General Proceeding
de: Grundsätzliches Vorgehen

# HTWAB_GeneralProceedingItem1
source: 1. Create new solution with an empty project (of type ClassLibrary)
de: 1. Neue Solution mit einem leeren Projekt (ClassLibrary) anlegen

# HTWAB_GeneralProceedingItem2
source: 2. Add OQF.Bot.Contracts.dll as reference to the project
de: 2. OQF.Bot.Contracts.dll als Referenz zum Projekt hinzufügen

# HTWAB_GeneralProceedingItem3
source: 3. Create a bot-class and derive it from IQuoridorBot
de: 3. Bot-Klasse erstellen und von IQuoridorBot ableiten

# HTWAB_GeneralProceedingItem4
source: 4. Implement the IQuoridor-interface
de: 4. IQuoridorBot-Interface implementieren

# HTWAB_GeneralProceedingItem5
source: 5. Start an test-application (e.g. PlayerVsBot) and test your bot
de: 5. Applikation (z.B. PlayerVsBot) starten und Bot testen

# HTWAB_ImportantClassesParagraphHeader
source: Important Classes/Enums/Structs at the OQF.Bot.Contracts.dll
de: Die wichtigsten Klassen/Enums/Structs in der OQF.Bot.Contracts.dll

# HTWAB_ImportantClassesParagraphNote
source: Note: All classes and structs are designed and implemented as immutables.
de: Anmerkung: Alle Klassen und Structs sind als unveränderliche Immutables realisiert.

# HTWAB_FieldCoordinateParagraphText
source: A FieldCoordinate defines a unique position on the board (see Quoridor-notation). The X- and Y-coordinate are implemented as enumerations.
de: Eine FieldCoordinate beschreibt eine Position auf dem Spieldfeld (siehe Quoridor-Notation). Die X- und Y-Koordinaten sind wiederum jeweils durch ein Enum representiert.

# HTWAB_PlayerAndStateParagraphHeader
source: Player and PlayerState
de: Player und PlayerState

# HTWAB_PlayerAndStateParagraphText
source: The Player-class defines the invariant values of a player. These are the name of player and his starting position (PlayerType) on the board. The current status of a player is represented by the PlayerState-class. There you can find a reference to the player, the current position of the player on the board and number of wall the has left to spend.
de: Der Spieler (Player) wird durch die Player-Klasse definiert. In ihr ist der Name des Spielers, sowie die Startposition (PlayerType) festgehalten. Diese Werte ändern sich während eines Spiels niemals. Der aktuelle Zustand des Spielers, wird durch PlayerState representiert. Dieser besteht aus einer Referenz zum Spieler, der aktuellen position auf dem Brett, sowie der Anzahl an Wänden, die der Spieler noch platzieren darf.

# HTWAB_WallParagraphText
source: The Wall-Class defines a wall on the board by its position and orientation (see Quoridor-notation). The position is FieldCoordinate and the orientation is defined by another enumeration.
de: Die Wand-Klasse und damit auch das Wand-Element definiert sich durch eine Position und Orientierung (siehe Quoridor-Notation). Erstere ist eine FieldCoordinate, letztere eine eigens für diesen Zweck erstellte Enumeration.

# HTWAB_BoardStateParagraphText
source: The current situation on the board is represented by the BoardState-class. All game-relevant informations are stored in it: all placed walls, the states of both players and the player who's turn it is. Additional to that can the complete game-history be reviewed by looking at LastBoardState and LastMove.
de: Der aktuelle Spielzustand wird durch BoardState dargestellt. Alle zu diesem Zeitpunkt relevanten Informationen sind darin zu finden: Alle platzierten Wände, die Status der beiden Spieler (PlayerState) und den Spieler, der am Zug ist. Zudem lässt sich über LastBoardState und LastMove, die komplette Spiel-Historie bis zu diesem Punkt rekonstruieren.

# HTWAB_MovesParagraphText
source: Based on the abstract superclass Move, there are 3 different moves to choose from each turn. The FigureMove, to move the Pawn, the WallMove, to place a wall on the board, and the Capitulation, if you think there is no chance of winning any more.
de: Von der abstrakten Oberklasse Move ausgehend gibt es 3 verschiedene Züge aus denen der Spieler/Bot bei jeder Runde auswählen muss. Der FigureMove, mit dessen Hilfe die Spielfigur bewegt werden kann, der WallMove, mit dem eine Wand platziert werden kann und der Capitulation, falls eine Lage gar zu aussichtslos ist.

# HTWAB_GameConstraintsParagraphText
source: The GameConstraints-class contains the two restrictions for a bot for a game. One is the maximal timespan a bot can take to think about its next move. The other is the maximum of total moves each player can make in this game, before it is aborted.
de: Die Klasse GameConstraints enthält die Rahmenbedingungen für das aktuelle Spiel. Dies ist die maximale Bedenkzeit (nur für Bots) und die maximale Anzahl an Zügen die möglich sind, bevor das Spiel abgebrochen wird.

# HTWAB_GameFlowParagraphHeader
source: The bot's view of the Gameflow
de: Spielablauf aus der Sicht eines Bots

# HTWAB_GameFlowItem1
source: 1. The method Init(PlayerType, GameConstraints) is called. Thereby the bot is told on which side of the board he is starting and how the constraints for the upcomming game are.
de: 1. Die Methode Init(PlayerType, GameConstraints) wird aufgerufen. Hier wird dem Bot mitgeteilt, auf welcher Seite des Bretts er startet und wie die Rahmenbedingungen für das kommende Spiel aussehen.

# HTWAB_GameFlowItem2
source: 2. Now the game is started. Every time when its the turn of the bot, the method DoMove(BoardState) is called. The argument tells how the current situation of the board is.
de: 2. Nun wird das Spiel gestartet und jedes mal, wenn der Bot an der Reihe ist einen Zug auszuführen, wird die Methode DoMove(BoardState) aufgerufen. Im Argument wird dem Bot der aktuelle Spielstand mitgeteilt.

# HTWAB_GameFlowItem3
source: 3. Now the bot has so much time, as the GameConstraints told him, to fire the NextMoveAvailable-Event to submit his next move.
de: 3. Jetzt hat der Bot maximal die, in den GameConstraints angegebene Zeit um das Event NextMoveAvailable zu feuern, um seinen nächsten Zug auszuführen.

# HTWAB_GameFlowItem4
source: 4. Then it is the opponend players turn. When he has finished moving and it is your turn again, the DoMove(BoardState)-method is called again. This will be repeated until there is a winner.
de: 4. Anschließend ist der Gegenspieler an der Reihe. Hat dieser auch seinen Zug ausgeführt, wird wieder die DoMove(BoardState)-Methode aufgerufen. Dies wiederholt sich, bis ein Sieger ermittelt ist.

# HTWAB_GameFlowItem5
source: 5. A bot can always submit a debug-message to the UI by fireing the DebugMessageAvailable-Event.
de: 5. Der Bot kann jederzeit durch das Feuern des DebugMessageAvailable-Events eine Text-Nachricht abschicken, welche anschließend auf der Oberfläche dargestellt wird.

# HTWAB_ExampleParagraphHeader
source: Examplary implementation
de: Beispiel-Implementierung

# HTWAB_ExampleParagraphText
source: The SimpleWalking bot is an examplary bot-implementation. You find it within the OpenQoridorFramework at 'OpenQuoridorFramework/Bots/SimpleWalkingBot/SimpleWalkingBot.cs' within the Git-repository (see About).
de: Eine beispielhafte Bot-Implementierung ist der SimpleWalkingBot. Dieser findet sich im Git-Repository des OpenQoridorFrameworks (siehe: Über) unter 'OpenQuoridorFramework/Bots/SimpleWalkingBot/SimpleWalkingBot.cs'.

# AP_SourceCodeSectionText
source: The sourceCode of the OpenQuoridorFramework can be found on gitHub
de: Der SourceCode des OpenQuoridorFrameworks befindet sich in einem Git-Repository auf GitHub

# PvB_DumpDebugToFileButtonCaption
source: Save
de: Speichern

# PvBH_PageHeader
source: Overview to 'Player vs Bot'
de: Übersicht zu 'Player vs Bot'

# PvBH_Note
source: Note: To submit a move just click on the board on the UI. You get a preview for wall-placement as well as for moving the pawn.
de: Hinweis: Um einen Zug zu machen, muss direkt auf das Spielfeld geklickt werden. Sowohl für die Wand-Elemente, wie auch für eine Figurbewegung steht eine Vorschau zur verfügung.

# PvB_DumpDebugFileDialogTitle
source: Save current Debug output
de: Speichere Debug-Nachrichten

# PvB_SaveGameProgressFileDialogTitle
source: Save Game Progress of currently ended game
de: Speichere Spielfortschritt von beendetem Spiel

# PvB_DumpProgressToFileButtonCaption
source: Save
de: Speichern

# PvB_DumpProgressFileDialogTitle
source: Save current Progress
de: Speichere aktuellen Spielstand

# PvB_StartWithProgressGameButtonToolTipCaption
source: Start Game from Progress-File
de: Spiel mit Verlaufsdatei starten

# PVR_EmptyOrInvalid
source: The progress is empty or invalid
de: Der Spielfortschritt ist leer oder ungültig

# PVR_ProgressContainsInvalidMove
source: The progress contains an invalid move
de: Der Spielfortschritt beinhaltet einen ungültigen Zug

# PVR_ProgressContainsTerminatedGame
source: The progress contains a game which already ended
de: Der Spielfortschritt beinhaltet ein Spiel, das bereits beendet ist

# HTWAB_HintParagraphHeader
source: Hint
de: Tipp

# HTWAB_HintParagraphText
source: You can simplify your debugging-process by modifying the properties of your bot-project in a way that the test-application PlayerVsBot is started automaticly with the bot loaded every time you start debugging. To do so (an example is shown in the picture above) you have to adjust the StartAction to launch the PlayerVsBot-application. In addition to that you have to add the result of the build-process (your bot-dll) as command-line-parameter for the test-application. Don't forget the quotation marks! There are three more possible CommandLine-Parameters. With "-disableBotTimeout" you can debug your bot as long as you want, without being interrupted by the bot's thinking-time-limit. And with "-disableClosingDialog" you can supress the dialogs which would be displayed if you close the program during a game. With '-progressFile="[...]"' you can start the game directly from an game-progress-file. This is helpful to debug a certain situation.
de: Das Debugging kann noch vereinfacht werden, wenn man das Bot-Projekt so verändert, dass beim Start des Debugging automatisch die PlayerVsBot-Applikation mit dem aktuellen Bot geladen wird. Hierzu muss, wie im Bild beispielhaft gezeigt, die 'Start Action' in den Project-Properties so angepasst werden, dass die PlayerVsBot-Applikation und nicht das eigentliche Projekt gestartet wird. Außerdem muss die aktuell gebaute DLL als Command-Line-Argument übergeben werden. Hier die Anführungszeigen nicht vergessen! Außerdem gibt es noch drei weitere CommandLine-Parameter, die angegeben werden können. Mit "-disableBotTimeout" wird der Bot nach nach 60 Sekunden nicht mehr unterbrochen. Hiermit sind folglich längere Debug-Sessions möglich. Und mit "-disableClosingDialog" wird verhindert, dass das Programm beim Schließen, während ein Spiel läuft, mit einem Dialog nachfragt, ob denn das Spiel wirklich abgebrochen werden soll. Mit '-progressFile="[...]"' kann eine Spielfortschrittsdatei angegeben werden, mit der das Spiel direkt gestartet wird, um beispielsweise eine bestimmte Situation einfacher debuggen zu können.

# PvBH_Explanation01
source: 1. Browse for a bot-dll on the hard-drive and load it
de: 1. Bot-DLL von der Festplatte suchen und laden

# PvBH_Explanation02
source: 2. Start a game (if a bot was loaded)
de: 2. Spiel starten (sofern vorher ein Bot gewählt wurde)

# PvBH_Explanation03
source: 3. Start a game from progress-file (if a bot was loaded)
de: 3. Spiel von Spielfortschrittsdatei starten (sofern vorher ein Bot gewählt wurde)

# PvBH_Explanation04
source: 4. Name of the bot you are playing against
de: 4. Name des Bots gegen den gespielt wird

# PvBH_Explanation05
source: 5. Choose language
de: 5. Anzeigesprache wählen

# PvBH_Explanation06
source: 6. Open Help
de: 6. Hilfe öffnen

# PvBH_Explanation07
source: 7. Expand or collapse the game-progress
de: 7. Spielfortschritt ein- und ausklappen

# PvBH_Explanation08
source: 8. Save current game-progress to a text-file
de: 8. Aktuellen Spielfortschritt in Text-Datei speichern

# PvBH_Explanation09
source: 9. Activate/deactivate auto-scroll-down of the game-progress
de: 9. Automatisches herunterscrollen des Spielfortschritts aktivieren/deaktivieren

# PvBH_Explanation10
source: 10. The progress of the ongoing game
de: 10. Spielfortschritt des aktuellen Spiels (siehe: Quoridor-Notation)

# PvBH_Explanation11
source: 11. Number of walls, which the bot has left to spend
de: 11. Anzahl an Wand-Elementen, die der Bot noch platzieren kann

# PvBH_Explanation12
source: 12. Save current debug-output to a text-file
de: 12. Aktuell dargestellte Debug-Nachtichten in Text-Datei speichern

# PvBH_Explanation13
source: 13. Activate/deactivate auto-scroll-down of the debug-output
de: 13. Automatisches herunterscrollen der Debug-Nachrichten aktivieren/deaktivieren

# PvBH_Explanation14
source: 14. Expand or collapse the debug-output
de: 14. Debug-Nachrichten-Bereich ein- und ausklappen

# PvBH_Explanation15
source: 15. Debug-output of the ongoing game
de: 15. Debug-Nachrichten des aktuellen Spiels

# PvBH_Explanation16
source: 16. Placed walls on the boad
de: 16. Platzierte Wand-Elemente auf dem Spielfeld

# PvBH_Explanation17
source: 17. Pawn of the bot (white)
de: 17. Spielfigur des Bots (weiß)
