Repository: bytePassion/OpenQuoridorFramework
Catalog: OpenQuoridorFramework/OQF.Resources/LanguageDictionaries/Captions.*.resx
Languages: de

# PvBH_Explanation18
source: 18. Pawn of the player (black)
de: 18. Spielfigur des Spielers (schwarz)

# PvBH_Explanation19
source: 19. Possible moving-field for your pawn
de: 19. Mögliches Zugfeld für den Spieler

# PvBH_Explanation20
source: 20. Resign from the game -> the bot wins
de: 20. Das Spiel aufgeben -> der Bot gewinnt

# PvBH_Explanation21
source: 21. Number of walls, which you have left to spend
de: 21. Anzahl der Wand-Elemente, die der Spieler noch platzieren kann

# ClosingDialogMessage
source: Do you want exit during a ongoing game?
de: Programm während eines laufenden Spiels beenden?

# SavingDialogMessage
source: Do you want to save the current game progress?
de: Aktuellen Spielfortschritt speichern?

# PvB_MovesLeftLabelCaption
source: Moves left
de: Übrige Züge

# PVR_ProgressContainsMoreMovesThanAllowed
source: The progress contains more moves than allowed in the upcomming game
de: Der Spielfortschirtt beinhaltet mehr Züge als im zu startenden Spiel erlaubt sind

# PvB_CompressedProgressCaption
source: Compressed progress-string
de: Kompremierter Spielfortschritt

# PvB_CopyToClipboardButtonToolTipCpation
source: Copy compressed progress to clipboad
de: Kopremierten Spielforschritt in Zwischenablage kopieren

# SID_CancelButtonCaption
source: Cancel
de: Abbrechen

# PvB_ProgressInputDialogPromt
source: Input the compressed Progress:
de: Geben Sie den kompremierten Spielfortschritt ein:

# PvB_StartGameFromFileButtonCaption
source: From file
de: Von Datei

# PvB_StartGameFromStringButtonCaption
source: From string
de: Von Zeichenkette
