Repository: bytePassion/OpenQuoridorFramework
Catalog: OpenQuoridorFramework/bytePassion.OnkoTePla.Resources/Languages/ClientLang/Client.*.resx
Languages: de

# AboutDialog_LicenceText
source: This software is under Apache 2.0 Licence
de: Diese Software steht unter Apache 2.0 Lizenz

# AboutDialog_DeveloperSectionHeader
source: Developer
de: Entwickler

# ConnectionStatus_Connected
source: connected to server
de: Mit Server verbunden

# ConnectionStatus_Disconnected
source: disconnected from server
de: Vom Server getrennt

# ConnectionStatus_TryingToConnect
source: trying to connect ....
de: versuche zu verbinden ....

# ConnectionStatus_TryingToDisconnect
source: trying to disconnect ....
de: versuche Verbindung zu trennen ....

# AddAppointmentDialog_Title
source: Add new appointment
de: Neuen Termin hinzufügen

# AddAppointmentDialog_DescriptionHeader
source: Description
de: Beschreibung

# AddAppointmentDialog_DurationHeader
source: Duration
de: Dauer

# AddAppointmentDialog_HourLabelCaption
source: h
de: Std

# AddAppointmentDialog_CreateButtonCaption
source: Create
de: Anlegen

# AddAppointmentDialog_CancelButtonCaption
source: Cancel
de: Abbrechen

# AddAppointmentDialog_NoPatientSelectedText
source: - no patient selected -
de: - noch kein Patient ausgewählt -

# EditAppointmentDialog_Title
source: Edit appointment
de: Termin bearbeiten

# EditAppointmentDialog_DescriptionSectionHeader
source: Description
de: Beschreibung

# EditAppointmentDialog_OkButtonCaption
source: Ok
de: Bestätigen

# EditAppointmentDialog_CancelButtonCaption
source: Cancel
de: Abbrechen

# LoadingPage_Text
source: Loading data from server ....
de: Daten werden vom Server geladen ....

# LoginPage_UserPromt
source: User:
de: Benutzer:

# LoginPage_PasswordPromt
source: Password:
de: Passwort:

# LoginPage_ConnectionSettingsSectionHeader
source: Connection settings
de: Verbindungsoptionen

# LoginPage_ServerIpPromt
source: Server-Ip-Address (e.g.: 192.128.1.234):
de: Server-IP-Adresse (z.B. 192.128.1.234):

# LoginPage_ConnectButtonCaption
source: Connect
de: Verbinden

# LoginPage_DisconnectButtonCaption
source: Disconnect
de: Verbindung trennen

# LoginPage_AutoConnectCheckboxCaption
source: Autoconnect on next start
de: Beim nächsten Start automatisch verbinden

# OverviewPage_PracticeSectionHeader
source: Practice
de: Praxis

# OverviewPage_RoomSectionHeader
source: Room
de: Raum

# OverviewPage_ClosedPracticeText
source: Closed
de: Geschlossen

# RoomSelector_AllRoomsItem
source: All rooms
de: Alle Räume

# SearchPage_NoAppointmentsText
source: No appointments existant
de: Keine Termine vorhanden

# SearchPage_ShowEarlierAppointmentsCheckBoxCaption
source: Show earlier appointments
de: Frühere Termine anzeigen

# NotificationMsg_PageCannotBeChanged
source: The page cannot be viewed, because an appointment is being edited
de: Die Seite kann nicht angezeigt werden da ein Termin noch in Bearbeitung ist

# NotificationMsg_AddingEventsFailed
source: The editing could not be completed. Please try again!
de: Die Bearbeitung konnte nicht abgeschlossen werden. Bitte noch einmal versuchen!

# NotificationMsg_SendAppointmentToClosedDay
source: You cannot move an appointment to a day where the practice is not open!
de: Ein Termin kann nicht an einen Tag verschoben werden an dem die Praxis geschlossen ist.

# NotificationMsg_SendAppointmentToNoSpace
source: You cannot move the appointment to this day, because no free slot is big enough
de: Der Termin kann nicht zu diesem Tag verschoben werden, da nicht genug Platz vorhanden ist.

# NotificationMsg_EndedBecauseOfConflict
source: The editing was aborted because of conflicts
de: Die Bearbeitung wurde wegen Konflitken abgebrochen

# NotificationMsg_DeletingFailed
source: Deleting failed - please try again!
de: Das Löschen des Termins ist fehlgeschlagen. Bitte noch einmal probieren.

# NotificationMsg_ModifyingFailed
source: Modification failed - please try again!
de: Die Erstellung des Termins ist fehlgeschlagen. Bitte noch einmal probieren.

# NotificationMsg_AddingFailed
source: Adding failed - please try again!
de: Die Modifizierung des Termins ist fehlgeschlagen. Bitte noch einmal probieren.

# NotificationMsg_SlotProtectionViolation
source: The appointment cannot be placed here - too many appointments are starting to close
de: Der Termin kann nicht hier abgelegt werden, da zu viele Termine zu nah bei einander beginnen

# ErrorMessage_CharacterError_Title
source: Inputerror
de: Eingabefehler

# ErrorMessage_CharacterError_Description_Msg
source: The description must not contain the following characters:
de: Die Beschreibung darf folgende Zeichen nicht enthalten:

# ErrorMessage_ConnectionInitError_BeforeIp
source: A connection to
de: Es kann keine Verbindung mit

# ErrorMessage_ConnectionInitError_AfterIp
source: cannot be established
de: hergestellt werden

# ErrorMessage_InvalidIp
source: is not a valid IP-address
de: ist keine gültige IP-Adresse

# ErrorMessage_LoginError
source: Login not possible
de: Login nicht möglich

# ErrorMessage_LoginErrorReason_WrongPassword
source: The password is incorrect
de: Das Passwort ist nicht korrekt

# ErrorMessage_LoginErrorReason_UserAlreadyLoggedIn
source: The user is already logged in
de: Der Benutzer ist bereits eingeloggt

# ErrorMessage_ConnectionProblem_Title
source: Connection-Problem
de: Verbindungsproblem

# ErrorMessage_ConnectionProblem_Msg_Part1
source: The connection to the server is lost.
de: Die Verbindung zum Server wurde unterbrochen.

# ErrorMessage_ConnectionProblem_Msg_Part2
source: You can try again in 15 seconds.
de: In 15 Sekunden kann ein erneuter Versuch unternommen werden.

# SearchPage_NoPatientSelected
source: - no patient selected -
de: - noch kein Patient ausgewählt -

# SearchPage_DeletingAppointmentPrompt
source: Do you really want to delete the appointment?
de: Wollen Sie den Termin wirklich löschen?

# SearchPage_NotAccessablePractice
source: [not accessable practice]
de: [nicht zugreifbare Praxis]

# NotificationMsg_EventHistoryWillBeReseted
source: The undo/redo-history will be reseted.
de: Die Rückgängig/Wiederherstellen-Funktion wird zurückgesetzt.

# NotificationMsg_RedoNotPossible
source: Redo not possible.
de: Rückgängig kann nicht ausgeführt werden.

# NotificationMsg_UndoNotPossible
source: Undo not possible.
de: Wiederherstellen kann nicht ausgeführt werden.

# FatalErrorMessage
source: A fatal and very unexpected error Occured
de: Ein schwerwiegender und völlig unerwarteter Fehler ist aufgetreten

# StringGenerator_DeletingAppointment
source: Do you want to delete the previous created appointment?
de: Wollen Sie den erstellten Termin wieder löschen?

# StringGenerator_ReaddAppointment
source: Do you want to restore the previous deleted appointment?
de: Wollen Sie den gelöschten Termin wieder herstellen?

# StringGenerator_UndoDividedMoveAppointment_Part1
source: Do you want to move the appointment of
de: Wollen Sie den Termin des Patienten

# StringGenerator_UndoDividedMoveAppointment_Part2
source: back?
de: zurückverschieben?

# StringGenerator_Part_From
source: from
de: von

# StringGenerator_Part_To
source: to
de: nach

# StringGenerator_Part_TherapyPlace
source: therapy-place
de: Therapieplatz

# StringGenerator_Part_Current
source: Current
de: Aktuell

# StringGenerator_Part_Description
source: Description
de: Beschreibung

# StringGenerator_Part_AfterUndoAction
source: After undo-action
de: Nach Rückgängig-Schritt

# StringGenerator_UndoReplaceAppointment_Part1
source: Du you want to take back the modification of the appointment of
de: Möchten Sie die Modifizierung des Termins von

# StringGenerator_Part_AfterRedoAction
source: After redo-action
de: Nach Wiederhestellen-Schritt

# StringGenerator_RedoReplaceAppointment_Part1
source: Du you want to restore the modification of the appointment of
de: Möchten Sie die Modifizierung des Termins von

# StringGenerator_RedoDividedMoveAppointment_Part1
source: Do you want to restore the movement of the appointment of
de: Wollen Sie die Modifizierung des Termins des Patienten

# OptionsPage_SelectLanguagePromt
source: Select your language:
de: Sprache wählen:

# MainWindow_CloseWindow_Title
source: Close application
de: Programm beenden

# MainWindow_CloseWindow_Text
source: Du you want to close the application?
de: Wollen Sie das Programm beenden?

# NotificationMsg_TooManyPatientsAtDay
source: The appointment cannot be placed here - the patient has already an appointment on this day
de: Der Termin kann hier nicht abgelegt werden, da der betroffene Patient an diesem Tag schon einen Termin hat.

# DateSelector_TodayButtonCaption
source: Today
de: Heute

# AddAppointmentDialog_HintText_Description
source: Enter description here
de: Hier Beschreibung eingeben

# EditAppointmentDialog_HintText_Description
source: Enter description here
de: Hier Beschreibung eingeben

# LoginPage_HintText_Password
source: Enter password here
de: Hier Passwort eingeben

# LoginPage_HintText_ServerAddress
source: Enter server address here
de: Hier Server-Adresse eingeben

# AppointmentLocationSelectionDialog_DateSectionHeader
source: Date
de: Tag

# AppointmentLocationSelectionDialog_PracticeSectionHeader
source: Practice
de: Praxis

# AppointmentLocationSelectionDialog_CreateAppointmentButtonCaption
source: Create new appointment
de: Neuen Termin anlegen

# AppointmentLocationSelectionDialog_CancelButtonCaption
source: Cancel
de: Abbrechen

# AppointmentEditButton_ConfirmChanges_ToolTip
source: Confirm changes
de: Änderungen übernehmen

# AppointmentEditButton_Copy_ToolTip
source: Copy
de: Kopieren

# AppointmentEditButton_Delete_ToolTip
source: Delete
de: Löschen

# AppointmentEditButton_DiscardChanges_ToolTip
source: Discard changes
de: Änderungen verwerfen

# AppointmentEditButton_Edit_ToolTip
source: Edit description and label
de: Beschreibung und Label bearbeiten

# AppointmentCount_Caption
source: Appointment count:
de: Anzahl Termine:

# OptionsPage_SelectProtectionZoneViewModePromt
source: Choose SlotProtection visibility:
de: SlotProtection-Sichtbarkeit wählen:

# OptionsPage_ProtectionZoneViewMode_Always
source: Always show protected zones
de: Zeige SlotProtection-Zonen immer an

# OptionsPage_ProtectionZoneViewMode_DoNotShow
source: Never show protected zones
de: Zeige SlotProtection-Zonen niemals an

# OptionsPage_ProtectionZoneViewMode_OnlyInEdit
source: Show protected zones only while editing
de: Zeige SlotProtection-Zonen nur während der Bearbeitung

# AddAppointmentDialog_BeginHeader
source: Begin
de: Terminbeginn

# AddAppointmentDialog_EarlierButtonCaption
source: Earlier appointment begin
de: Früherer Terminbeginn

# AddAppointmentDialog_LaterButtonCaption
source: Later appointment begin
de: Späterer Terminbeginn

# AddAppointmentDialog_Hint_NoDescription
source: Hint: No appointment description entered
de: Hinweis: Keine Terminbeschreibung eingetragen

# AddAppointmentDialog_Hint_NoPatient
source: Hint: No patient selected
de: Hinweis: Noch ist kein Patient ausgewählt

# AddAppointmentDialog_Hint_NoSpace
source: Hint: There is no space for that appointment
de: Hinweis: Für diesen Termin ist kein Platz vorhanden

# AddAppointmentDialog_Hint_PatientHasAlreadyAppointment
source: Hint: This patient has already an appointment that day
de: Hinweis: Der Patient hat an diesem Tag schon einen Termin

# AddAppointmentDialog_EarlierButtonNotPossibleCaption
source: Earlier begin not possible
de: Früherer Terminbeginn nicht möglich

# AddAppointmentDialog_LaterButtonNotPossibleCaption
source: Later begin not possible
de: Späterer Terminbeginn nicht möglich
